<?php
include '../functions.php';
header_natec(
    'Стати учасником спільноти',
    '/member-login.php',  // Ccылка на перевод RU,
    '/uk/member-login.php', // Ccылка на перевод UA,
    '/en/member-login.php'  // Ccылка на перевод EN
);
?>

    <div role="main">
        <article class="content wrap" id="_content" data-uid="">
            <div class="container container-nosidebar">

                <h1>Стати учасником спільноти</h1>

                <img src="/images/profile_template.png" style="width: 150px;margin-bottom: 15px;">
                <p><b>Шановний Візіонер</b>,</p>

                <p>Від імені групи MEF.DEV запрошую Вас стати одним із учасників спільноти цифрової трансформації. Група MEF.DEV призначена для менеджерів, ІТ-інженерів і розробників, які беруть участь у Цифровій трансформації, проектуючи програмне забезпечення та інструменти, які сприятимуть взаємодії як всередині компанії, так і з клієнтами.</p>
                <p>Мета групи підказати, з чого почати в проектах Цифрової трансформації, і як розробникам, які володіють технічними знаннями, отримати необхідні управлінські навички для успішної реалізації проекту. Як правило, цифрова трансформація вимагає трансформації процесу розробки, тому учасники групи можуть обмінюватися думками, як краще модернізувати способи розробки і впровадження програмного забезпечення. Це значно збільшує шанси на успішну цифрову трансформацію і ставить роль ІТ на провідне місце в проекті.</p>
                <p>Ось кілька переваг, які Ви отримаєте, ставши учасником групи:</p>
                <ul>
                    <li>зможете дізнатися про практичний досвід інших учасників в реалізації проектів цифрової трансформації</li>
                    <li>задати іншим учасникам питання і отримати конкретні відповіді з урахуванням українського досвіду реалізації проектів</li>
                </ul>

                <div class="row" style="margin-bottom: 10px;margin-top: 15px;">
                    <div class="col-lg-2 col-sm-3">
                        <div style="position: relative;">
                            <img src="/images/linkedin-join.png" style="max-width: 165px;"><a href="https://www.linkedin.com/groups/9050042/" style="position: absolute;left:0;top:0;width: 100%;height: 100%;"></a>
                        </div>
                    </div>
                    <div class="col-sm-7">
                        <p>А тепер важлива деталь - натисніть <a href="https://www.linkedin.com/groups/9050042/">тут</a>, щоб приєднатися до нашої групи в LinkedIn зараз і дізнатися більше про проекти Цифрової трансформації в Україні.</p>
                    </div>
                </div>

                <p>Дякую за увагу. З нетерпінням чекаю на Ваше членство в групі і сподіваюся на Вашу активну участь у житті спільноти.</p>
                <p>З повагою,<br>
                    <b>Сергій Половников<br>та <a href="https://youtu.be/CRbDMFil0_8">MEF.DEV Authors</a></b></p>
            </div>
            <!-- End Container -->
        </article>
    </div>
<?php
footer_natec();
?>