<?php
include '../functions.php';
header_natec(
    'Політика конфіденційності',
    '/privacy-policy.php',  // Ccылка на перевод RU,
    '/uk/privacy-policy.php', // Ccылка на перевод UA,
    '/en/privacy-policy.php'  // Ccылка на перевод EN
);
?>

    <div role="main">
        <article class="content wrap" id="_content" data-uid="">
            <div class="container container-nosidebar">
                <h1>Політика конфіденційності</h1>
                <p><i>Останнє оновлення: 10 березня 2021 року</i></p>
                <img src="/images/privacy.jpeg" alt="Політика конфіденційності">
                <p></p>
                <p><i>Ми збиратимемо, використовуватимемо та поширюватимемо вашу інформацію тільки так, як описано в цій політиці.</i></p>

                <h2>Про цю політику</h2>
                <p>Так само, як <a href="https://mef.dev/terms-of-use.php" target="_blank">Умови надання послуг</a> і <a class="scroll_terms" href="#cookie">Як ми використовуємо файли cookie та подібні технології</a>, ця політика пояснює, як ми збираємо та обробляємо вашу інформацію на всіх сайтах, у всіх мобільних додатках та інших службах. Час від часу ми переглядатимемо цю політику, щоб переконатися, що вона актуальна. Якщо ми внесемо зміни, ми опублікуємо останню версію політики тут. Якщо ми внесемо суттєві зміни, ми повідомимо вас про це під час вашого наступного доступу до наших послуг або іншим способом.</p>

                <h2>Чому та як ми використовуємо ваші особисті дані?</h2>
                <p>Ми використовуємо вашу інформацію, лише якщо ви дали нам свою згоду, якщо інформація необхідна для надання послуг, які ви запитували, якщо це необхідно для реалізації законних прав або виконання законних обов’язків, або для звичайних бізнес-цілей, визначених у цій політиці.</p>

                <h2>Які особисті дані ми збираємо?</h2>
                <p>Ми збираємо, зберігаємо та обробляємо певну інформацію про кожного, хто користується нашими послугами. Проте ми не збираємо більше інформації, ніж потребуємо.</p>

                <h2>Як довго ми зберігаємо ваші особисті дані?</h2>
                <p>Ми зберігаємо ваші дані, лише доки ми цього потребуємо або доки від нас цього вимагає закон. Потім ми або видаляємо ваші дані, або робимо їх анонімними, щоб вони не могли вас ідентифікувати. Ми поводимося з даними відповідно до цілі, для якої вони використовуються. Але ви можете в будь-який час попросити нас видалити їх.</p>

                <h2>Коли вашу інформацію збирають треті сторони або отримують доступ до неї?</h2>
                <p>Ми надаємо доступ до вашої інформації, лише коли ви нас просите про це, якщо це необхідно для співпраці з вами та надання вам послуг, або якщо від нас цього вимагає закон. Компанії, які використовують додатки через MEF.DEV (наприклад, NatecEntities API або інтерфейси BankFeed), збиратимуть ваші дані відповідно до їхніх власних політик. Іноді компанії, які рекламуються через наші послуги, також можуть збирати вашу інформацію (див. розділ Як ми використовуємо файли cookie та подібні технології). Крім того, компанії, які допомагають нам надавати послуги, також збиратимуть та використовуватимуть ваші дані від нашого імені.</p>

                <h2>Як ми гарантуємо безпеку ваших особистих даних?</h2>
                <p>Захист вашої конфіденційності – невід’ємна частина нашої культури, і ми використовуємо поєднання стандартних для галузі методів захисту.</p>

                <h2>Де ми зберігаємо вашу інформацію?</h2>
                <p>Ваші дані надійно зберігаються в центрах обробки даних у всьому світі. Точне розташування залежить від того, де ви перебуваєте, коли використовуєте MEF.DEV. Ваші дані обробляють лише постачальники, які надають відповідні договірні гарантії щодо інформації, яку вони обробляють. Іноді ваші дані можуть зберігатися в країнах з іншими рівнями безпеки в порівнянні з вашою країною, але ми завжди переконуємося, що стандарти цих країн відповідають нашим.</p>

                <h2>Як ваша інформація використовується для реклами?</h2>
                <p>Під час використання наших послуг ви бачитимете різноманітні рекламні оголошення, а також ви можете побачити рекламу MEF.DEV, перебуваючи на інших платформах. Ці оголошення можуть надходити від нас або від третіх сторін, і вони можуть бути персоналізованими для вас, щоб відображати інформацію, яка може вас зацікавити. Інформація, яка використовується для персоналізації рекламних оголошень, що ви бачите, може містити інформацію про ваші пошукові запити на MEF.DEV або загальну інформацію про розташування на рівні міста, але ніколи не міститиме ваше ім’я, контактну інформацію та інші дані, які б дозволили ідентифікувати вас в реальному світі.</p>

                <h2 id="cookie">Чи використовує MEF.DEV файли cookie або схожі технології?</h2>
                <p>Ми використовуємо файли cookie та схожі технології для надання, оптимізації, персоналізації й аналізу наших послуг, а також для рекламних цілей.</p>

                <h2>Як ми використовуємо файли cookie та подібні технології</h2>
                <p>Ми використовуємо файли cookie та подібні технології, коли ви користуєтеся нашими службами. Ці файли cookie та подібні технології контролюємо безпосередньо ми або треті сторони, що діють від нашого імені чи незалежно.</p>
                <p>Ми використовуємо файли cookie та подібні технології, коли вони необхідні для надання наших послуг, для покращення вашого досвіду за допомогою засобів аналітики й оптимізації, а також для відображення персоналізованої реклами. Далі ви дізнаєтеся більше про керування файлами cookie та подібними технологіями.</p>
                <p>Коли ви отримуєте доступ до MEF.DEV через наш веб-сайт або додаток, ми збираємо ваші дані й отримуємо до них доступ за допомогою файлів cookie та подібних технологій, необхідних для належної роботи наших служб. Ви не можете відмовитися від цих файлів cookie та подібних технологій, оскільки без них MEF.DEV не працюватиме. Так само від них не можуть відмовитися інші веб-сайти та додатки. Ми обмежуємо ці файли cookie та подібні технології лише тими, які абсолютно необхідні для надання вам продуктів і послуг, що ви запитували. Наприклад, ми використовуємо файли cookie та подібні технології для наступних цілей:</p>

                <ul>
                    <li>Щоб визначити, чи використовуєте ви послугу в постачальника додатка, до якого ви перейшли завдяки MEF.DEV. Ця інформація потрібна нам, щоб забезпечити правильну роботу посилань між додатками та платформою MEF.DEV, а також щоб виявляти та виправляти будь-які проблеми чи помилки</li>
                    <li>Щоб забезпечувати роботу таких функцій, як формування підписки та запуску додатків у середовищі платформи MEF.DEV і на сайтах або ресурсах наших партнерів, наприклад хмарних ресурсів або додатків</li>
                    <li>Щоб пам’ятати інформацію, від якої залежить відображення інформації. Наприклад, це ваші налаштування мови та валюти або функції платформи MEF.DEV, доступність яких залежить від таких факторів, як ваш пристрій або ваші місто чи країна</li>
                    <li>Щоб пам’ятати користувальницький контекст, як-от роль, дати та кількість підписок, коли ви переходите між сторінками та передаєте цю інформацію постачальникам додатків платформи MEF.DEV, до яких вас спрямовує сайт або додаток MEF.DEV, або щоб переспрямовувати вас у конкретні розділи нашого додатку чи нашого сайту</li>
                    <li>Щоб збирати важливу інформацію про те, як використовуються наші продукти та послуги. Ця інформація впливає на важливі рішення щодо продукту, оновлення та зміни продукту, а також на функції, доступні на певних ринках</li>
                    <li>Щоб убезпечити наші служби від автоматизованих агентів, ботів і шахрайської діяльності</li>
                    <li>Щоб забезпечити роботу входу в систему та служб підтримки клієнтів</li>
                </ul>

                <h2>Як я можу відкликати мою згоду на використання файлів cookie та подібних технологій?</h2>
                <p>Коли ви вперше отримуєте доступ до наших послуг на своєму пристрої, ми просимо вас дозволити нам використовувати файли cookie та подібні технології відповідно до цієї політики. Якщо ви не дозволяєте нам використовувати ці технології або якщо ви передумали пізніше, ви можете відкликати свою згоду, використовуючи методи, наведені в цій політиці, або ви можете припинити користуватися нашими послугами.</p>

                <h2>Докладніше</h2>
                <p>Якщо у вас є запитання щодо цієї політики або ви хотіли б дізнатися більше про файли cookie, які використовуються на наших веб-сайтах, зв’яжіться з нами.</p>

                <h2>Права користувача MEF.DEV</h2>
                <p>Якщо у вас є обліковий запис MEF.DEV, ви можете будь-коли отримувати доступ до основних особистих даних, пов’язаних із вашим профілем, редагувати, завантажувати чи видаляти їх у своєму профілі. Тут ви теж можете керувати своїми налаштуваннями підписки та маркетингових сповіщень.</p>
                <p>У вас також є певні права стосовно своїх особистих даних, які ми зібрали. Щоб скористатися своїми правами щодо даних, зверніться до нас любим зручним для вас способом.</p>

                <h2>Хто ми та як із нами зв’язатися? </h2>
                <p>Сайт MEF.DEV належить компанії NATEC R&D LLC., зареєстрованої в України.</p>
                <p>Компанія NATEC R&D LLC. контролює всю інформацію, яку ми збираємо від вас.</p>
                <p>Наш номер телефону: 044-3905280</p>
                <p>Офіційна адреса: 15-17, вулиця Герцена, Київ, Україна, 04050.</p>

            </div>
            <!-- End Container -->
        </article>
        <script>
            let locations = document.location.href
            let elem = document.querySelectorAll('.scroll_terms')

            elem.forEach(function(userItem) {
                let h = userItem.href
                if(locations !== h) {
                    let s = userItem.nextElementSibling
                    s.style.display = "none"
                }
            })

            let linkNav = document.querySelectorAll('[href^="#"]')
            let V = 0.2

            for (var i = 0; i < linkNav.length; i++) {
                linkNav[i].addEventListener('click', function(e) {
                    e.preventDefault();
                    let w = window.pageYOffset
                    let hash = this.href.replace(/[^#]*(.*)/, '$1')
                    let t = document.querySelector(hash).getBoundingClientRect().top - 100
                    let start = null

                    console.log(t);

                    requestAnimationFrame(step);

                    function step(time) {
                        if (start === null) start = time;
                        let progress = time - start
                        let r = (t < 0 ? Math.max(w - progress/V, w + t) : Math.min(w + progress/V, w + t))
                        window.scrollTo(0,r)

                        if (r != w + t) {
                            requestAnimationFrame(step)
                        } else {
                            location.hash = hash
                        }
                    }
                }, false)
            }
        </script>
    </div>
<?php
footer_natec();
?>