<?php
include '../functions.php';
header_natec(
    'Умови користування',
    '/terms-of-use.php',  // Ccылка на перевод RU,
    '/uk/terms-of-use.php', // Ccылка на перевод UA,
    '/en/terms-of-use.php'  // Ccылка на перевод EN
);
?>

<div role="main">
    <article class="content wrap" id="_content" data-uid="">
        <div class="container container-nosidebar">
            <h1>Умови користування</h1>
            <img src="/images/terms.jpg" alt="Условия использования">
            <p>Останнє оновлення: 10 березня 2021 р.</p>
            <h2>Умови користування</h2>
            <h2>Хто ми?</h2>
            <p>MEF.DEV («ми», «наш», «нас» в залежності від контексту) - це міжнародна компанія, що надає послуги по взаємодії застосунків, розроблених третьою стороною, а також інші пов'язані з процесом користування застосунків послуги, в тому числі публікація і управління конфігурацією (тут і далі «Послуги MEF.DEV») користувачам по всьому світу через наші веб-сайти, програми та платформу («Платформа MEF.DEV»).</p>
            <p>MEF.DEV - це не постачальник конкретного застосунку, а тому ми не несемо відповідальності за надання послуг автором конкретного застосунку, а також за формування і підтримання цін на будь-які продукти і послуги (такі як підписки і користування сховищами даних), які ви можете використовувати з застосуванням Послуг MEF.DEV або Платформи MEF.DEV («Продукти третіх осіб»). Всі такі Продукти третіх осіб надаються незалежними розробниками, постачальниками програмного забезпечення та іншими третіми особами, а тому на них поширюються умови, сформульовані такими третіми особами.</p>
            <p>Послуги MEF.DEV і Платформа MEF.DEV надаються NATEC R&D LLC, приватною компанією з обмеженою відповідальністю, зареєстрованою в Україні під номером 38650436. Відомості про нашу компанію, в тому числі поштова адреса та юридична адреса, доступні для пошуку і перегляду на <a href="https://usr.minjust.gov.ua/content/free-search" target="_blank">цій сторінці</a>.</p>

            <h2>Ці умови</h2>
            <p>Ці умови користування (надалі «Умови») регулюють ваш доступ до Послуг MEF.DEV і (або) Платформи MEF.DEV і разом з нашою <a href="/uk/privacy-policy.php">політикою конфіденційності</a> становлять юридично зобов'язуючу угоду між вами і MEF.DEV. Завантажуючи, відкриваючи або іншим чином використовуючи Послуги MEF.DEV і (або) Платформу MEF.DEV, ви тим самим підтверджуєте, що прочитали, зрозуміли і приймаєте ці Умови та умови <a href="/uk/privacy-policy.php">політики конфіденційності</a>.</p>
            <p>На деякі з Послуг і (або) Платформу MEF.DEV (наприклад, на Платформу MEF.DEV в сценарії Intranet розгортання) поширюються інші умови користування. В такому випадку ви повинні будете підтвердити свою згоду з такими умовами користування, які будуть діяти замість справжніх Умов або разом з ними.</p>
            <p>Ми можемо вносити зміни до цих Умов у будь-який час на свій розсуд. Якщо до цих Умов вносяться зміни, ми будемо відображати оновлені умови в рамках Послуг MEF.DEV і (або) Платформи MEF.DEV. У цьому випадку буде вважатися, що ви прийняли будь-які зміни, якщо продовжуєте використовувати Послуги MEF.DEV і (або) Платформу MEF.DEV після відображення змін.</p>
            <p>Якщо ви не приймаєте всі ці Умови, то ви не можете користуватися Послугами MEF.DEV або Платформою MEF.DEV.</p>

            <h2>Користування Послугами MEF.DEV</h2>
            <p>Ви можете користуватися Послугами MEF.DEV і Платформою MEF.DEV тільки відповідно до чинного законодавства і для законних цілей. З урахуванням того, що ви погоджуєтесь дотримуватися цих Умов, ми надаємо вам не передаваєму невиключну ліцензію на завантаження, відкриття і користування Послугами MEF.DEV і (або) Платформою MEF.DEV в ваших особистих комерційних чи некомерційних цілях, а не для будь-яких інших цілей. Зокрема, ми надаємо вам таку ліцензію за умови, що ви погоджуєтесь не:</p>

            <ol>
                <li>використовувати Послуги MEF.DEV і (або) Платформу MEF.DEV у будь-яких неналежних або незаконних цілях, а також не публікувати і не поширювати матеріали, які (а) є наклепницькими, образливими, непристойними або іншим чином неприйнятними; (б) порушують конфіденційність, недоторканність приватного життя або будь-які права третіх осіб, у тому числі авторське право, права на торговельні марки або інші права на інтелектуальну власність; або (в) вводять в оману щодо вашої особистості;</li>
                <li>використовувати Послуги MEF.DEV і (або) Платформу MEF.DEV у будь-яких цілях або будь-яким способом, який може завдати шкоди для MEF.DEV або пошкодити репутації MEF.DEV;</li>
                <li>розбирати, розкривати технологію або іншим чином декомпілювати будь-яке програмне забезпечення або програми, що містяться у Послугах MEF.DEV і (або) Платформі MEF.DEV або надаються через неї, за винятком випадків, коли це дозволено законом або постачальником Продукту третіх осіб;</li>
                <li>копіювати, поширювати, доводити до загального відома, продавати, здавати в оренду або іншим чином використовувати Послуги MEF.DEV і (або) Платформу MEF.DEV, намагатися обійти будь-які заходи безпеки, прийняті для запобігання або обмеження вашого доступу до Послуг MEF. DEV і (або) Платформи MEF.DEV і їх використання;</li>
                <li>користуватися Послугами MEF.DEV і (або) Платформою MEF.DEV або втручатися в їх роботу таким чином, що це може завдати шкоди, перевантажити і інакше негативно вплинути на наші системи та заходи безпеки, або зробити їх недоступними, а також вплинути на інших користувачів;</li>
                <li>впроваджувати в Послуги MEF.DEV і (або) Платформу MEF.DEV або передавати через них будь-який шкідливий програмний код, віруси, атаки типу «відмова в обслуговуванні» або «спам», черви або трояни</li>
                <li>видаляти, змінювати або замінювати будь-які повідомлення про авторство, товарні знаки, фірмові найменування, логотипи або інші позначення походження з Послуг MEF.DEV і (або) Платформи MEF.DEV, а також видавати або намагатися видати Послуги MEF.DEV і (або) Платформу MEF.DEV за продукт будь-якого іншого розробника, крім як компанії MEF.DEV, окрім випадків явно передбачених для Продуктів третіх осіб;</li>
                <li>використовувати будь-які автоматизовані комп'ютерні програми або програми для сканування, копіювання та іншого користування Послугами MEF.DEV і (або) Платформою MEF.DEV або будь-якої їх частини, крім випадків явно передбачених для Продуктів третіх осіб.</li>
            </ol>

            <p>Якщо ви входите для користування будь-якої складової Послуг MEF.DEV і (або) Платформи MEF.DEV або використовуєте їх, для чого потрібен обліковий запис Google, ви підтверджуєте, що особисто будете нести відповідальність за підтримання конфіденційності та безпеки пароля та відомостей для входа. Якщо вам стає відомо про порушення безпеки ваших відомостей для входа у систему або можете запідозрити таке порушення з будь-якої причини, обов'язково повідомте нам будь-яким зручним для Вас способом у найкоротші терміни.</p>
            <p>Послуги MEF.DEV і Платформи MEF.DEV не призначені для дітей віком до 13 років, та особи віком до 13 років не можуть надавати будь-яку інформацію Послуг MEF.DEV і (або) Платформи MEF.DEV або через них. Ми не ведемо навмисний збір особистої інформації дітей віком до 13 років, і якщо дізнаємося про те, що зібрали або отримали особисту інформацію від дитини віком до 13 років, то видалимо цю інформацію у відповідності зі своєю <a href="/uk/privacy-policy.php">політикою конфіденційності</a>.</p>
            <p>Якщо будь-який елемент Послуг MEF.DEV і (або) Платформи MEF.DEV розміщується на сторонньому веб-сайті (наприклад, в маркетпрейсе або Інтернет-магазині) і існують окремі умови користування, пов'язані з цим стороннім веб-сайтом, ви погоджуєтеся повністю дотримуватися таких умов.</p>

            <h2>Надання нам інформації</h2>
            <p>Ми поважаємо конфіденційність вашої інформації і незмінно працюємо відповідно до чинного законодавства про захист даних. Ви визнаєте, що будь-яка інформація особистого порядку, яку ви надаєте через Послуги MEF.DEV і (або) Платформу MEF.DEV, може використовуватися нами відповідно до нашої <a href="/uk/privacy-policy.php">політики конфіденційності</a>.</p>
            <p>Ви погоджуєтеся забезпечувати точність і актуальність всієї інформації особистого характеру, яку ви надаєте нам, а також наявність у вас всіх дозволів і ліцензій, необхідних, щоб дати нам можливість використовувати цю інформацію відповідно до цих Умов та нашої <a href="/uk/privacy-policy.php">олітики конфіденційності</a>.</p>
            <p>У зв'язку з тим, що Послуги MEF.DEV і (або) Платформа MEF.DEV дозволяють вам публікувати, завантажувати, передавати інформацію, зображення, відео або інші дані, роблячи їх доступними для MEF.DEV або інших користувачів MEF.DEV («Вміст користувача»), ви погоджуєтесь, що:</p>

            <ol>
                <li>ви несете одноосібну відповідальність за Вміст користувача, який ви завантажуєте, а також що ви не будете публікувати будь-яку інформацію, на публікацію якої у вас немає дозволів або прав і щодо якої ви не можете надати ліцензію, описану в параграфі (2) нижче;</li>
                <li>хоча всі права на інтелектуальну власність, пов'язані з будь-яким Вмістом користувача, будуть належати вам або вашим ліцензіарам, наступним ви надаєте MEF.DEV та компанім, що входять до группи, невиключне, безстрокове, безоплатне, що діє по всьому світу та підлягає передачі (в тому числі по субліцензії) право на користування, відтворення в електронній та інших формах, відображення, поширення, зміну, адаптацію, публікацію, переклад, створення похідних творів на основі будь-якого такого Вмісту користувача (за винятком інформації особистого характеру), в тому числі для цілей реклами і маркетингу Послуг MEF.DEV і (або) Платформи MEF.DEV;</li>
                <li>мы не обязаны хранить, сохранять, публиковать или делать доступным любое Пользовательское содержимое, загруженное вами, а вы самостоятельно несете ответственность за создание резервных копий любого такого Пользовательского содержимого в случае необходимости.</li>
            </ol>
            <p>У випадку, коли ви відправляєте нам будь-які пропозиції, коментарі, ідеї щодо поліпшення або інший зворотній зв’зок («Відгуки»), наступним ви надаєте нам повне право на інтелектуальну власність щодо таких Відгуків і визнаєте, що ми можемо використовувати такі Відгуки у будь-яких цілях на свій власний розсуд. Ви можете відправити нам Відгук будь-яким зручним для Вас способом.</p>

            <h2>Власність MEF.DEV</h2>
            <p>За винятком випадків, викладених в інших положеннях цих Умов, всі права на інтелектуальну власність, в тому числі та серед іншого авторські права (включаючи авторські права на програмне забезпечення), патенти, торгові марки або фірмові найменування, права на дизайн, права на бази даних, ноу-хау, комерційну таємницю та право на захист конфіденційності щодо Послуг та Платформи MEF.DEV (разом - «Права на інтелектуальну власність») належать MEF.DEV або надані MEF.DEV за ліцензією. Ви визнаєте, що користування Послугами MEF.DEV і (або) Платформою MEF.DEV не дає вам ніяких прав власності або інших прав щодо Послуг MEF.DEV і (або) Платформи MEF.DEV, а також прав на інтелектуальну власність за винятком обмеженої ліцензії на користування Послугами MEF.DEV і Платформою MEF.DEV, наданої вам відповідно до цих Умов. Ви також підтверджуєте, що не маєте права на доступ до будь-яких аспектів Послуг MEF.DEV і (або) Платформи MEF.DEV у вигляді вихідного коду.</p>

            <h2>Власність інших осіб</h2>
            <p>Ми поважаємо права на інтелектуальну власність інших осіб. Якщо у вас є підстави вважати, що ваші авторські права порушуються будь-яким вмістом Послуг MEF.DEV і (або) Платформи MEF.DEV, відправте письмове повідомлення про таке порушення за адресою <a href="mailto:admin@mef.dev">admin@mef.dev</a>.</p>

            <h2>Точність цін та відмова від гарантійних зобов'язань</h2>
            <p>Ви використовуєте Послуги MEF.DEV і (або) Платформу MEF.DEV виключно на свій власний страх та ризик.</p>
            <p>Хоча ми дотримуємося суворої політики «точності ціни» в роботі з усіма партнерами, які надають нам дані про Продукти третіх осіб, і прагнемо забезпечити актуальність і точність вмісту, що відображається в рамках Послуг та Платформи MEF.DEV, ми не можемо гарантувати достовірність і точність такого вмісту. Ми надаємо Послуги і Платформу MEF.DEV на умовах «як є» і категорично відмовляємося від будь-яких гарантій і умов будь-якого роду, як явних, так і тих, що маються на увазі, в тому числі та серед іншого, від гарантій прав власності, непорушення, придатності для конкретної мети і точності, а також будь-яких гарантій, що маються на увазі в процесі користування, ведення справ або виконання.</p>
            <p>У тій мірі, в якій це дозволено законом, ми не робимо ніяких заяв і не гарантуємо вам, що Послуги MEF.DEV і Платформа MEF.DEV: (a) є точними, повними і актуальними; (б) завжди будуть доступні; (в) будуть відповідати вашим очікуванням; (г) є безпечними, не містять помилок, несправностей, дефектів, вірусів або шкідливих програм.</p>

            <h2>Здійснення користування застосунків через MEF.DEV</h2>

            <p>MEF.DEV не є постачальником конкретного застосунку для користування на Платформі MEF.DEV і не несе відповідальності за Продукти третіх осіб, доступних для використування за допомогою Послуг MEF.DEV і (або) Платформи MEF.DEV, а також за формування і підтримання цін, які ми показуємо за їх користування, якщо вони передбачені постачальником Продукту третіх осіб.</p>
            <p>Будь-які Продукти третіх осіб, які ви використовуєте за допомогою Послуг MEF.DEV і (або) Платформи MEF.DEV, надаються незалежними розробниками, постачальниками програмного забезпечення або іншими третіми особами («Постачальники продуктів третіх осіб»).</p>
            <p>MEF.DEV спрощує для вас процес користування послугами Постачальників продуктів третіх осіб, але не несе відповідальності перед вами щодо такого користування. Ви отримаєте інформацію про конкретного постачальника продуктів третіх осіб і умовах, що поширюються на користування Продуктами третіх осіб у цього постачальника («Умови постачальника продуктів третіх осіб»), в момент початку його використуання. Ви повинні прочитати і повністю їх зрозуміти, перш ніж виконувати підписку на Продукти третіх осіб у цього постачальника.</p>
            <p>В Умовах постачальника продуктів третіх осіб буде обумовлюватися, які права у вас є у відносинах із Постачальником продуктів третіх осіб, і буде описана відповідальність перед вами в разі виникнення будь-яких проблем.</p>
            <p>Ви погоджуєтесь повністю дотримуватися всіх Умов постачальника продуктів третіх осіб. Ви визнаєте, що порушення Умов постачальника продуктів третіх осіб може привести до скасування користування, втрати призначених для користувача і інших даних, а також до додаткових зборів.</p>
            <p>Якщо ви використовуєте Платформу MEF.DEV, щоб використовувати два або більше пов'язаних Продуктів третіх осіб, але від різних Постачальників продуктів третіх осіб (наприклад, підтримка DNS провайдера А і хостинг постачальника Б), то таке користування може вважатися «Зв'язаними послугами для користування» в залежності від того, де ви знаходитесь та які на вас поширюються закони про захист прав споживачів.</p>
            <p>Якщо Ви створили Пов'язані послуги для користування, у вас не буде того ж рівня захисту прав споживача, який ви отримали б, якби використовували Продукти третіх осіб через одного Постачальника продуктів третіх осіб (де ви могли б у такому випадку отримати переваги, пропоновані пакетом послуг). Це означає, що вам потрібно покладатися на кожного постачальника окремо в тому, що він належним чином надасть відповідні послуги, причому ви не зможете звернутися до суду зі скаргою на Послуги MEF.DEV і (або) Платформу MEF.DEV.</p>

            <h2>Обмеження і винятки відповідальності</h2>

            <p>У цих Умовах викладена вся повнота зобов'язань MEF.DEV щодо Послуг та Платформи MEF.DEV.</p>
            <p>MEF.DEV не несе ніякої відповідальності відносно будь-яких домовленостей між вами і будь-якою третьою особою, досягнутих в результаті користування вами Послугами MEF.DEV і (або) Платформою MEF.DEV (в тому числі та без обмежень з будь-якими Постачальниками продуктів третіх осіб). У разі виникнення будь-яких проблем з Продуктом третіх осіб, яке ви використовуєте або намагаєтесь скористатися через MEF.DEV, ви погоджуєтесь, що вам слід вирішувати проблему з відповідним Постачальником продуктів третіх осіб, а всі можливі доступні вам засоби захисту, в тому числі відшкодування грошових коштів, надаються відповідним Постачальником продуктів третіх осіб, а не MEF.DEV.</p>
            <p>Якщо Послуги MEF.DEV і (або) Платформи MEF.DEV містять посилання на інші сайти або ресурси, що надаються третіми особами, ці посилання публікуються виключно для інформації. Ми ні в якому вигляді не контролюємо вміст цих сайтів або ресурсів і не беремо на себе відповідальність за них або за будь-які збитки чи шкоду, які можуть виникнути у зв'язку з їх використанням.</p>
            <p>Якщо Послуги MEF.DEV і (або) Платформи MEF.DEV містять посилання на інші сайти або ресурси, що надаються третіми особами, ці посилання публікуються виключно для інформації. Ми ні в якому вигляді не контролюємо вміст цих сайтів або ресурсів і не беремо на себе відповідальність за них або за будь-які збитки чи шкоду, які можуть виникнути у зв'язку з їх використанням.</p>
            <p>У максимально дозволеної законом ступені ми (в тому числі наші посадові особи, директора, співробітники, представники, афілійовані особи, постачальники та треті особи) не несемо відповідальності за: (a) будь-які неточності або упущення у вмісті, який відображається через Послуги MEF.DEV і (або) Платформу MEF.DEV; (б) будь-які стихійні явища, аварії, затримки або будь-які спеціальні, штрафні, випадкові або непрямі збитки чи шкоду будь-якого роду (включаючи без обмежень упущену вигоду або втрачені заощадження), що виникли на підставі контракту, правопорушення (включаючи халатність), суворої відповідальності або іншим чином, які ви понесли у зв'язку з вашим доступом до Послуг MEF.DEV і (або) Платформи MEF.DEV і їх користуванням, або неможливістю доступу до них, а також у зв'язку з будь-яким їхнім вмістом.</p>
            <p>Відповідно до цих Умов і в межах, що допускаються законом, наша максимальна сукупна відповідальність перед вами, що випливає з цих Умов або у зв'язку з вашим доступом до Послуг MEF.DEV і (або) Платформи MEF.DEV, їх користуванням або неможливістю доступу до них або їх користування, обмежена сумою в 4000 грн. (чотири тисячі гривень).</p>

            <h2>Ваші зобов'язання перед нами</h2>
            <p>Відповідно до цих Умов ви будете нести відповідальність і зобов'язання перед нами по відношенню до всіх судових розглядів і позовів (включаючи крім іншого судові витрати), стороною яких стали ми або наша компанія, будь-які з наших посадових осіб, директорів, співробітників і агентів в результаті або у зв'язку з користуванням вами Послугами MEF.DEV і (або) Платформою MEF.DEV, або порушенням цих Умов.</p>

            <h2>Припинення дії</h2>
            <p>MEF.DEV може на свій власний розсуд негайно припинити будь-яка угоду з вами відповідно до цих Умов у будь-який момент, відправивши вам відповідне повідомлення, а в разі наявності у вас облікового запису, скасувавши ваше членство і ваш доступ до облікового запису. MEF.DEV може призупинити користування вами Послугами MEF.DEV і (або) Платформою MEF.DEV у будь-який момент без жодної відповідальності перед вами.</p>

            <h2>Загальні положення</h2>
            <p>Ви визнаєте, що незаконне користування Послугами MEF.DEV і (або) Платформою MEF.DEV може призвести до непоправних збитків та порушення прав компанії MEF.DEV і (або) її дочірніх компаній або ліцензіарів, щодо яких грошова компенсація збитку буде неможлива. Отже, в разі такого незаконного користування, ми і наші дочірні компанії, і (або) ліцензіари будуть (згідно з обставинами) мати право у додаток до будь-яких інших доступних засобів правового захисту, вдатися до негайної заборони на подальше користування Послугами MEF.DEV і (або) Платформою MEF.DEV..</p>
            <p>Недійсність або нездійсненність будь-якого положення (повністю або частково) цих Умов не вплине на дійсність або застосовність інших положень (в цілому або частково). Якщо будь-яке положення буде повністю або частково визнано судом компетентної юрисдикції недійсним або нездійсненним, воно буде вважатися відповідним чином видаленим з цих Умов.</p>
            <p>Ці Умови поширюються на вас особисто. Ви не маєте права передавати свої права та зобов'язання за цими Умовами в цілому або частково будь-якій третій стороні без нашої попередньої письмової згоди.</p>
            <p>Ці Умови являють собою всю повноту угоди між нами і вами, та замінюють собою всі можливі колишні правила, умови, угоди і домовленості щодо користування вами Послугами MEF.DEV і (або) Платформою MEF.DEV.</p>
            <p>Ми будемо негайно реагувати у разі появи відомостей про Вміст користувача, який порушує ці Умови. Якщо ви знаєте про будь-яку протизаконну діяльність або підозрюєте її, знаєте про порушення прав на належні вам роботи або підозрюєте про це, напишіть нам про це за адресою <a href="mailto:admin@mef.dev">admin@mef.dev</a>.</p>
            <p>Якщо ми не реалізуємо у примусовому порядку будь-яке з положень цих Умов, це не буде вважатися нашою відмовою від них або від права на примусову реалізацію будь-якої з цих Умов в подальшому.</p>
            <p>Особа, яка не є стороною цих Умов, не має права реалізовувати будь-які їх положення.</p>
            <p>Незалежно від того, з якої країни ви відкриваєте або користуєтесь Послугами MEF.DEV і (або) Платформою MEF.DEV, в межах, що допускаються законом, ці Умови та користування вами Послугами MEF.DEV і (або) Платформою MEF.DEV будуть регулюватися законодавством України, а ви погоджуєтесь на невиключну юрисдикцію судів України для вирішення будь-яких суперечок, які можуть виникнути за цими Умовами.</p>

            <h2>Звернення до нас</h2>
            <p>Якщо вам потрібна додаткова інформація про MEF.DEV або у вас є пропозиції щодо вдосконалення Послуг MEF.DEV і (або) Платформи MEF.DEV, звертайтеся будь-яким зручним для Вас способом.</p>

        </div>
        <!-- End Container -->
    </article>
    
</div>
<?php
footer_natec();
?>
